memtier/performance/data/lab-pc61/strong.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.5 Latency   p99.9 Latency       KB/sec 
--------------------------------------------------------------------------------------------------------------------------------------------
Sets         8638.13          ---          ---         2.10970         1.33500        41.72700        44.03100        47.87100       589.54 
Gets        86379.61       130.72     86248.88         2.10300         1.32700        41.47100        43.77500        47.61500      2191.71 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---          --- 
Totals      95017.74       130.72     86248.88         2.10361         1.32700        41.47100        43.77500        47.61500      2781.25 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.159        0.000
SET       1.255        5.000
SET       1.271       10.000
SET       1.287       15.000
SET       1.295       20.000
SET       1.303       25.000
SET       1.311       30.000
SET       1.319       35.000
SET       1.319       40.000
SET       1.327       45.000
SET       1.335       50.000
SET       1.335       52.500
SET       1.335       55.000
SET       1.343       57.500
SET       1.343       60.000
SET       1.343       62.500
SET       1.351       65.000
SET       1.351       67.500
SET       1.351       70.000
SET       1.359       72.500
SET       1.359       75.000
SET       1.367       76.250
SET       1.367       77.500
SET       1.367       78.750
SET       1.375       80.000
SET       1.375       81.250
SET       1.383       82.500
SET       1.383       83.750
SET       1.391       85.000
SET       1.399       86.250
SET       1.415       87.500
SET       1.423       88.125
SET       1.447       88.750
SET       1.503       89.375
SET       2.463       90.000
SET       2.543       90.625
SET       2.575       91.250
SET       2.591       91.875
SET       2.623       92.500
SET       2.639       93.125
SET       2.639       93.750
SET       2.655       94.062
SET       2.655       94.375
SET       2.671       94.688
SET       2.671       95.000
SET       2.687       95.312
SET       2.687       95.625
SET       2.703       95.938
SET       2.703       96.250
SET       2.719       96.562
SET       2.751       96.875
SET       2.767       97.031
SET       2.815       97.188
SET       3.695       97.344
SET       4.287       97.500
SET       4.351       97.656
SET       4.351       97.812
SET       4.383       97.969
SET       5.471       98.125
SET       6.559       98.281
SET      28.671       98.438
SET      33.791       98.516
SET      35.839       98.594
SET      37.631       98.672
SET      39.167       98.750
SET      40.447       98.828
SET      41.215       98.906
SET      41.471       98.984
SET      41.983       99.062
SET      42.239       99.141
SET      42.495       99.219
SET      42.751       99.258
SET      43.007       99.297
SET      43.263       99.336
SET      43.263       99.375
SET      43.519       99.414
SET      43.775       99.453
SET      44.031       99.492
SET      44.287       99.531
SET      44.287       99.570
SET      44.543       99.609
SET      44.799       99.629
SET      44.799       99.648
SET      45.055       99.668
SET      45.311       99.688
SET      45.311       99.707
SET      45.567       99.727
SET      45.823       99.746
SET      45.823       99.766
SET      46.079       99.785
SET      46.335       99.805
SET      46.335       99.814
SET      46.591       99.824
SET      46.591       99.834
SET      46.847       99.844
SET      46.847       99.854
SET      47.103       99.863
SET      47.359       99.873
SET      47.359       99.883
SET      47.615       99.893
SET      47.871       99.902
SET      47.871       99.907
SET      48.127       99.912
SET      48.127       99.917
SET      48.383       99.922
SET      48.639       99.927
SET      48.639       99.932
SET      48.895       99.937
SET      49.151       99.941
SET      49.407       99.946
SET      49.663       99.951
SET      49.663       99.954
SET      49.919       99.956
SET      50.175       99.958
SET      50.175       99.961
SET      50.431       99.963
SET      50.687       99.966
SET      50.943       99.968
SET      51.199       99.971
SET      51.455       99.973
SET      51.711       99.976
SET      51.711       99.977
SET      51.967       99.978
SET      52.223       99.979
SET      52.479       99.980
SET      52.735       99.982
SET      52.991       99.983
SET      53.247       99.984
SET      53.759       99.985
SET      54.015       99.987
SET      55.039       99.988
SET      55.551       99.988
SET      56.063       99.989
SET      56.831       99.990
SET      57.855       99.990
SET      59.391       99.991
SET      60.671       99.991
SET      61.695       99.992
SET      63.231       99.993
SET      65.279       99.993
SET      67.071       99.994
SET      68.607       99.994
SET      69.631       99.995
SET      70.655       99.995
SET      71.167       99.995
SET      71.679       99.995
SET      72.703       99.996
SET      73.215       99.996
SET      74.239       99.996
SET      75.263       99.997
SET      76.287       99.997
SET      76.799       99.997
SET      77.311       99.997
SET      77.823       99.997
SET      78.335       99.998
SET      78.847       99.998
SET      79.359       99.998
SET      79.871       99.998
SET      80.383       99.998
SET      80.895       99.998
SET      81.919       99.998
SET      82.431       99.999
SET      82.431       99.999
SET      82.943       99.999
SET      82.943       99.999
SET      83.455       99.999
SET      83.967       99.999
SET      84.479       99.999
SET      84.479       99.999
SET      84.991       99.999
SET      84.991       99.999
SET      85.503       99.999
SET      85.503       99.999
SET      86.015       99.999
SET      86.015       99.999
SET      86.015       99.999
[...]
SET      86.015      100.000
SET      86.527      100.000
SET      87.039      100.000
SET      87.039      100.000
SET      88.063      100.000
SET      88.575      100.000
SET      88.575      100.000
SET      89.087      100.000
SET      89.087      100.000
SET      89.087      100.000
[...]
SET      89.599      100.000
SET      89.599      100.000
SET      90.111      100.000
SET      90.111      100.000
SET      90.111      100.000
[...]
SET      91.135      100.000
SET      91.135      100.000
SET      91.647      100.000
SET      91.647      100.000
SET      91.647      100.000
[...]
SET      92.159      100.000
SET      92.159      100.000
SET      92.159      100.000
[...]
SET      95.231      100.000
SET      95.231      100.000
SET      95.231      100.000
[...]
SET      96.255      100.000
SET      96.255      100.000
SET      96.255      100.000
[...]
SET     109.567      100.000
SET     109.567      100.000
---
GET       0.135        0.000
GET       1.247        5.000
GET       1.271       10.000
GET       1.287       15.000
GET       1.295       20.000
GET       1.303       25.000
GET       1.311       30.000
GET       1.311       35.000
GET       1.319       40.000
GET       1.327       45.000
GET       1.327       50.000
GET       1.335       52.500
GET       1.335       55.000
GET       1.335       57.500
GET       1.343       60.000
GET       1.343       62.500
GET       1.343       65.000
GET       1.351       67.500
GET       1.351       70.000
GET       1.351       72.500
GET       1.359       75.000
GET       1.359       76.250
GET       1.367       77.500
GET       1.367       78.750
GET       1.367       80.000
GET       1.375       81.250
GET       1.375       82.500
GET       1.383       83.750
GET       1.383       85.000
GET       1.391       86.250
GET       1.407       87.500
GET       1.415       88.125
GET       1.431       88.750
GET       1.479       89.375
GET       2.383       90.000
GET       2.527       90.625
GET       2.559       91.250
GET       2.591       91.875
GET       2.607       92.500
GET       2.623       93.125
GET       2.639       93.750
GET       2.655       94.062
GET       2.655       94.375
GET       2.655       94.688
GET       2.671       95.000
GET       2.671       95.312
GET       2.687       95.625
GET       2.687       95.938
GET       2.703       96.250
GET       2.719       96.562
GET       2.735       96.875
GET       2.751       97.031
GET       2.799       97.188
GET       3.695       97.344
GET       4.287       97.500
GET       4.319       97.656
GET       4.351       97.812
GET       4.383       97.969
GET       5.407       98.125
GET       6.431       98.281
GET      28.543       98.438
GET      33.535       98.516
GET      35.839       98.594
GET      37.375       98.672
GET      38.911       98.750
GET      40.191       98.828
GET      40.959       98.906
GET      41.471       98.984
GET      41.727       99.062
GET      41.983       99.141
GET      42.495       99.219
GET      42.751       99.258
GET      42.751       99.297
GET      43.007       99.336
GET      43.263       99.375
GET      43.519       99.414
GET      43.519       99.453
GET      43.775       99.492
GET      44.031       99.531
GET      44.287       99.570
GET      44.543       99.609
GET      44.543       99.629
GET      44.799       99.648
GET      45.055       99.668
GET      45.055       99.688
GET      45.311       99.707
GET      45.311       99.727
GET      45.567       99.746
GET      45.823       99.766
GET      46.079       99.785
GET      46.079       99.805
GET      46.335       99.814
GET      46.335       99.824
GET      46.591       99.834
GET      46.591       99.844
GET      46.847       99.854
GET      46.847       99.863
GET      47.103       99.873
GET      47.359       99.883
GET      47.615       99.893
GET      47.615       99.902
GET      47.871       99.907
GET      47.871       99.912
GET      48.127       99.917
GET      48.127       99.922
GET      48.383       99.927
GET      48.639       99.932
GET      48.639       99.937
GET      48.895       99.941
GET      49.151       99.946
GET      49.407       99.951
GET      49.663       99.954
GET      49.663       99.956
GET      49.919       99.958
GET      50.175       99.961
GET      50.175       99.963
GET      50.431       99.966
GET      50.687       99.968
GET      50.943       99.971
GET      51.199       99.973
GET      51.455       99.976
GET      51.711       99.977
GET      51.967       99.978
GET      51.967       99.979
GET      52.223       99.980
GET      52.479       99.982
GET      52.735       99.983
GET      52.991       99.984
GET      53.503       99.985
GET      54.015       99.987
GET      54.783       99.988
GET      55.295       99.988
GET      55.807       99.989
GET      57.087       99.990
GET      58.111       99.990
GET      59.391       99.991
GET      60.671       99.991
GET      61.951       99.992
GET      63.743       99.993
GET      66.047       99.993
GET      68.095       99.994
GET      69.119       99.994
GET      70.143       99.995
GET      70.655       99.995
GET      71.679       99.995
GET      72.191       99.995
GET      72.703       99.996
GET      73.215       99.996
GET      74.239       99.996
GET      74.751       99.997
GET      75.263       99.997
GET      75.775       99.997
GET      76.287       99.997
GET      76.799       99.997
GET      77.311       99.998
GET      77.823       99.998
GET      78.847       99.998
GET      79.871       99.998
GET      80.895       99.998
GET      81.407       99.998
GET      81.919       99.998
GET      82.431       99.999
GET      82.943       99.999
GET      83.455       99.999
GET      83.967       99.999
GET      84.479       99.999
GET      84.479       99.999
GET      84.991       99.999
GET      85.503       99.999
GET      86.015       99.999
GET      86.527       99.999
GET      86.527       99.999
GET      87.039       99.999
GET      87.551       99.999
GET      87.551       99.999
GET      88.063       99.999
GET      88.575       99.999
GET      89.087      100.000
GET      89.599      100.000
GET      90.111      100.000
GET      90.623      100.000
GET      91.135      100.000
GET      92.159      100.000
GET      94.207      100.000
GET      95.743      100.000
GET      98.815      100.000
GET     103.423      100.000
GET     109.567      100.000
GET     205.823      100.000
GET     206.847      100.000
GET     206.847      100.000
GET     206.847      100.000
GET     207.871      100.000
GET     207.871      100.000
GET     207.871      100.000
GET     208.895      100.000
GET     210.943      100.000
GET     211.967      100.000
GET     211.967      100.000
GET     212.991      100.000
GET     212.991      100.000
GET     242.687      100.000
GET     244.735      100.000
GET     245.759      100.000
GET     248.831      100.000
GET     250.879      100.000
GET     253.951      100.000
GET     255.999      100.000
GET     258.047      100.000
GET     259.071      100.000
GET     260.095      100.000
GET     260.095      100.000
GET     261.119      100.000
GET     262.143      100.000
GET     264.191      100.000
GET     264.191      100.000
GET     266.239      100.000
GET     266.239      100.000
GET     268.287      100.000
GET     268.287      100.000
GET     270.335      100.000
GET     270.335      100.000
GET     270.335      100.000
[...]
GET     272.383      100.000
GET     272.383      100.000
GET     272.383      100.000
[...]
GET     274.431      100.000
GET     274.431      100.000
GET     276.479      100.000
GET     276.479      100.000
GET     276.479      100.000
[...]
GET     278.527      100.000
GET     278.527      100.000
GET     278.527      100.000
[...]
GET     280.575      100.000
GET     280.575      100.000
---
WAIT      0.000      100.000